Revit 2024 API
BuiltInFailures.GridChainSketchFailures.InvalidSketch Property
 Sketch is invalid. Grid sketch must consist of a single open loop with no intersecting lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSketch { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.GridChainSketchFailures Class
Autodesk.Revit.DB Namespace